---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.HostObjAttributes
source: html/27062538-00e5-8949-2e47-6f2f955ec17e.htm
---
# HostObjAttributes Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.